Table of Contents
 Interface IMemberHiddenCheck
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Provides seamlessly data about connections or allows to run hidden calculation of a connection
[ServiceContract]
public interface IMemberHiddenCheck
Methods
 Calculate(int)
[OperationContract]
string Calculate(int subStructureId)
Parameters
subStructureId int
Returns
string
 Cancel()
Cancel current calcullation
[OperationContract]
void Cancel()
 CloseProject()
Close project which is open in the service
[OperationContract]
void CloseProject()
 OpenProject(string)
Open idea project in the service
[OperationContract]
void OpenProject(string projectLocation)
Parameters
projectLocation string
 Edit this page